# Pair Programming ETL IV

En este ejercicio nos crearemos dos tablas en una BBDD creada por nosotras. 

Una de las tablas contendr치 la informaci칩n que obtuvimos de los ejercicios de pair programming de Limpieza, es decir, el data set de ataques de tiburones limpito. 

La segunda tabla tendr치 la informaci칩n obtenida en el ejercicio de pair de ETL 1.


游늷 Nota Todo lo tendremos que hacer desde jupyter notebook

In [24]:
from IPython.core.interactiveshell import InteractiveShell 
InteractiveShell.ast_node_interactivity = "all"

import requests
import pandas as pd
import numpy as np

import mysql.connector

pd.options.display.max_columns = None

1. Cread la BBDD con el nombre de tiburones.

In [25]:
def crear_bbdd(nombre_bbdd):

    mydb = mysql.connector.connect(
      host="localhost",
      user="root",
      password="AlumnaAdalab" 
    )
    print("Conexi칩n realizada con 칠xito")
    
    mycursor = mydb.cursor()

    try:
        mycursor.execute(f"CREATE DATABASE IF NOT EXISTS {nombre_bbdd};")
        print(mycursor)
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [26]:
mydb = crear_bbdd("tiburones1")

Conexi칩n realizada con 칠xito
MySQLCursor: CREATE DATABASE IF NOT EXISTS tiburones1..

2. Cread las tablas de la BBDD:
    - Tabla ataques 
    - Tabla clima

In [27]:
def crear_insertar_tabla(nombre_bbdd, contrase침a, query):
    
    cnx = mysql.connector.connect(user='root', password=f"{contrase침a}",
                                     host='127.0.0.1', database=f"{nombre_bbdd}")

    mycursor = cnx.cursor()
    
   
    try: 
        mycursor.execute(query)
        cnx.commit() 
    
    except mysql.connector.Error as err:
        print(err)
        print("Error Code:", err.errno)
        print("SQLSTATE", err.sqlstate)
        print("Message", err.msg)

In [28]:
df_ataque = pd.read_csv('../datos/datos_limpiezaV.csv', index_col = 0)
df_clima = pd.read_csv('../datos/datos_clima.csv', index_col = 0)

In [29]:
df_ataque.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1666 entries, 0 to 1665
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   year              1666 non-null   float64
 1   country           1666 non-null   object
 2   age               1518 non-null   object
 3   species           1545 non-null   object
 4   date              1666 non-null   object
 5   month             1617 non-null   object
 6   fatal             1666 non-null   object
 7   sex               1652 non-null   object
 8   main_species      1666 non-null   object
 9   age_numbers       1666 non-null   float64
 10  age_numbers_mean  1666 non-null   float64
 11  sex_moda          1666 non-null   object
dtypes: float64(3), object(9)
memory usage: 169.2+ KB

In [30]:
df_ataque.isnull().sum()

year                  0
country               0
age                 148
species             121
date                  0
month                49
fatal                 0
sex                  14
main_species          0
age_numbers           0
age_numbers_mean      0
sex_moda              0
dtype: int64

In [31]:
tabla_ataques = '''
CREATE TABLE IF NOT EXISTS `tiburones1`.`ataques` (
  `id` INT NOT NULL AUTO_INCREMENT,
  `year` FLOAT NOT NULL,
  `country` VARCHAR (45) NOT NULL,
  `age` VARCHAR (45),
  `species` VARCHAR (45),
  `date` VARCHAR (45) NOT NULL,
  `month` VARCHAR (45) ,
  `fatal` VARCHAR (45) NOT NULL,
  `sex` VARCHAR (45) ,
  `main_species` VARCHAR (45) NOT NULL,
  `age_numbers` FLOAT NOT NULL,
  `age_numbers_mean` FLOAT NOT NULL,
  `sex_moda` VARCHAR (45) NOT NULL,
  PRIMARY KEY (`id`))
ENGINE = InnoDB;
'''

In [32]:
df_clima.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 320 entries, 0 to 63
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   timepoint          320 non-null    int64
 1   cloudcover         320 non-null    int64
 2   highcloud          320 non-null    int64
 3   midcloud           320 non-null    int64
 4   lowcloud           320 non-null    int64
 5   rh_profile         320 non-null    object
 6   wind_profile       320 non-null    object
 7   temp2m             320 non-null    int64
 8   lifted_index       320 non-null    int64
 9   rh2m               320 non-null    int64
 10  msl_pressure       320 non-null    int64
 11  prec_type          320 non-null    object
 12  prec_amount        320 non-null    int64
 13  snow_depth         320 non-null    int64
 14  wind10m.direction  320 non-null    int64
 15  wind10m.speed      320 non-null    int64
 16  country            320 non-null    object
dtypes: int64(13), object(4)
memory usage: 45.0+ KB

In [49]:
tabla_clima = '''
CREATE TABLE IF NOT EXISTS `tiburones1`.`clima` (
  `id_clima` INT NOT NULL AUTO_INCREMENT,
  `timepoint` INT  NOT NULL,
  `cloudcover` INT (45) NOT NULL,
  `highcloud` INT (45) NOT NULL,
  `midcloud` INT (45) NOT NULL,
  `lowcloud` INT (45) NOT NULL,
  `rh_profile` VARCHAR (45) NOT NULL,
  `wind_profile` VARCHAR (45) NOT NULL,
  `temp2m` INT (45) NOT NULL,
  `lifted_index` INT (45) NOT NULL,
  `rh2m` INT (45) NOT NULL,
  `msl_pressure` INT (45) NOT NULL,
  `prec_type` VARCHAR (45) NOT NULL,
  `prec_amount` INT (45) NOT NULL,
  `snow_depth` INT (45) NOT NULL,
  `wind10m.direction` INT (45) NOT NULL,
  `wind10m.speed` INT (45) NOT NULL,
  `country` VARCHAR (45) NOT NULL,
  `id` INT NOT NULL,
  PRIMARY KEY (`id_clima`),
  CONSTRAINT `fk_clima_ataques`
    FOREIGN KEY (`id`)
    REFERENCES `tiburones1`.`ataques` (`id`))
ENGINE = InnoDB;
'''

In [50]:
nombre_bbdd = "tiburones1"
contrase침a = "AlumnaAdalab"

In [51]:
tabla_tiburones = crear_insertar_tabla(nombre_bbdd, contrase침a, tabla_ataques)

In [52]:
tablas2 = crear_insertar_tabla("tiburones1","AlumnaAdalab",tabla_clima)